In [178]:
import requests
from bs4 import BeautifulSoup
import pandas as pd
import datetime

In [ ]:
page = requests.get('https://www.larvalabs.com/cryptopunks/topsales')
soup = BeautifulSoup(page.content, 'html.parser')
print(soup.prettify)

In [180]:
punk_id = []
for ids in soup.find_all('div', attrs={'class': 'm-t-10'}):
  punk_id.append([ids.get_text()])

df_id = pd.DataFrame(punk_id)

In [181]:
price = []
for prices in soup.find_all('div', attrs = {'class': 'col-md-2 col-sm-3 col-xs-6 container-punk-event-large'}):
  price.append(prices.find_all('div')[4].get_text())

df_price = pd.DataFrame(price)

In [182]:
date = []
for dates in soup.find_all('div', attrs = {'class': 'col-md-2 col-sm-3 col-xs-6 container-punk-event-large'}):
  date.append(dates.find_all('div')[5].get_text())

df_date = pd.DataFrame(date)

In [183]:
df_top_sales = df_id
df_top_sales = df_top_sales.rename(columns={0:'punk_id'})
df_top_sales['punk_id']= df_top_sales['punk_id'].replace({'#':''}, regex=True)
df_top_sales['punk_id'] = df_top_sales['punk_id'].astype(str).astype(int)
df_top_sales.head()

   punk_id
0     7804
1     3100
2     6965
3     2140
4     3011

In [184]:
#Join Prices
df_top_sales = df_top_sales.join(df_price, on=df_top_sales.index, how='left', lsuffix='_', rsuffix='_')
df_top_sales = df_top_sales.rename(columns={0:'prices'})

#Split Prices into two columns
df_top_sales[['price_in_eth', 'price_in_dollars']] = df_top_sales['prices'].str.split(' ', 1, expand=True)
del df_top_sales['prices']
df_top_sales.head()

   punk_id price_in_eth price_in_dollars
0     7804        4.2KΞ         ($7.57M)
1     3100        4.2KΞ         ($7.58M)
2     6965         800Ξ         ($1.54M)
3     2140         750Ξ         ($1.18M)
4     3011         667Ξ         ($1.76M)

In [185]:
#Remove special characters
df_top_sales['price_in_eth']= df_top_sales['price_in_eth'].replace({'Ξ':''}, regex=True)
df_top_sales['price_in_dollars'] = df_top_sales['price_in_dollars'].replace(to_replace='\(', value="", regex=True)
df_top_sales['price_in_dollars'] = df_top_sales['price_in_dollars'].replace(to_replace='\)', value="", regex=True)
df_top_sales['price_in_dollars'] = df_top_sales['price_in_dollars'].str.replace('$', '')
df_top_sales.head()

   punk_id price_in_eth price_in_dollars
0     7804         4.2K            7.57M
1     3100         4.2K            7.58M
2     6965          800            1.54M
3     2140          750            1.18M
4     3011          667            1.76M

In [186]:
#Convert strings into numbers
df_top_sales['price_in_eth'] = df_top_sales['price_in_eth'].replace({'K': '*1e3'}, regex=True).map(pd.eval).astype(int)
df_top_sales['price_in_dollars'] = df_top_sales['price_in_dollars'].replace({'K': '*1e3', 'M': '*1e6'}, regex=True).map(pd.eval).astype(int)
df_top_sales.head()

   punk_id  price_in_eth  price_in_dollars
0     7804          4200           7570000
1     3100          4200           7580000
2     6965           800           1540000
3     2140           750           1180000
4     3011           667           1760000

In [187]:
#Join Dates
df_top_sales = df_top_sales.join(df_date, on=df_top_sales.index, how='left', lsuffix='_', rsuffix='_')
df_top_sales = df_top_sales.rename(columns={0:'date_of_sale'})
df_top_sales['date_of_sale'] = pd.to_datetime(df_top_sales['date_of_sale'], infer_datetime_format=True)

In [189]:
df_top_sales

    punk_id  price_in_eth  price_in_dollars date_of_sale
0      7804          4200           7570000   2021-03-11
1      3100          4200           7580000   2021-03-11
2      6965           800           1540000   2021-02-19
3      2140           750           1180000   2021-03-02
4      3011           667           1760000   2021-04-27
5      4156           650           1250000   2021-02-18
6      2890           605            761890   2021-01-23
7      6487           550           1050000   2021-02-22
8      3393           500            954650   2021-03-13
9      2484           480           1080000   2021-04-19
10     2306           461            975130   2021-04-18
11     2140           400            731600   2021-02-22
12     3011           400            726460   2021-03-12
13     6704           380            785470   2021-04-08
14     3609           375            683060   2021-03-29
15     3609           369            566000   2021-03-05
16     1839           360            653810   2021-03-12
17     5234           350            545810   2021-03-04
18     2964           305            660120   2021-04-13
19     1119           300            442860   2021-02-26
20     2681           277            539530   2021-02-19
21     3106           240            426360   2021-03-16
22     6297           215            343930   2021-02-07
23      824           200            574950   2021-05-01
24     1119           200            326930   2021-02-24
25     7996           198            351390   2021-03-21
26     3307           189            137520   2020-12-30
27     4513           185             63790   2020-10-03
28     2484           175            311010   2021-02-17
29     7273           169            299930   2021-03-21
30      143           165            312720   2021-03-14
31     8620           165            307950   2021-03-14
32     8010           155            329040   2021-04-10
33     8865           155            262330   2021-03-23
34     6721           150            394970   2021-04-27
35     2924           150             71400   2020-11-13
36      843           150            268750   2021-03-17
37     6634           150            355420   2021-04-22
38     7261           145            220090   2021-03-03
39     8617           145            261820   2021-03-21
40     2329           140            259510   2021-02-12
41     5314           140             54980   2020-09-17
42     8219           140            150270   2021-01-06
43      924           135            289000   2021-04-12
44      638           130            277360   2021-04-10
45      627           130            342880   2021-04-27
46     8472           130            224930   2021-02-11
47     6784           130            224930   2021-02-11
48     3489           130            224930   2021-02-11
49     1651           125            222360   2021-03-11
50     2306           125            217170   2021-02-11
51     4441           125            218210   2021-03-12
52     7338           125            238040   2021-03-14
53     1775           122            221420   2021-03-18
54     4333           120            213460   2021-03-11
55     2000           120            276120   2021-04-13
56     8870           120            201480   2021-02-04
57     3308           115            239190   2021-04-02
58     5601           115            200280   2021-03-12
59     8620           110            166460   2021-02-27